{"id":315,"name":"PawSitter","description":"Това е мобилно приложение, което свързва хората, търсещи гледачи за своя домашен любимец, с тези, които искат да се грижат за животни. Търсенето за подходящи хора се осъществява за вид домашен любимец и основна услуга, времеви диапазон и град. След като се открият резултати за гледачи, отговарящи на изискванията на клиента, той може да прецени на кого да се довери спрямо ревютата, които са оставили предишни клиенти на гледача. Следващата стъпка е да се изберат свободни часови диапазони от графика на гледача, както и да се добяват допълнителни услуги, при желание за такива. Последната стъпка е банковото разплащане, с което се изпраща известия на наетия гледач, че има извършено наемане към него. Това наемане може да бъде както потвърдено, така и отказано. Всеки обикновен потребител може да подаде кандидатура, в която да включи своя снимка, кратко описание за себе си и да избере най-удобен за него град, в който да бъде търсен и наеман от потребителите. Тази кандидатура се подава към администраторите на приложението, които я разглеждат и връщат отговор за това дали потребителят е одобрен. Гледачите имат и няколко допълнителни функционалности в профила си. Приложението е така направено, че да им даде максимална свобода и гъвкавост при създаването на график, а след това при нужда и променянето му. Всеки има възможност да промени кои услуги да изпълнява и за каква цена, както и за кои животни да се грижи. Последната роля на мобилното приложение е администраторската. Администраторите могат да преглеждат предишни и предстоящи наемания на всички гледачи, да следят показателите на приложението (колко са приходите за предходните месеци, кои услуги се използват най-много), както и да одобряват или отхвърлят подадени кандидатури за ставане на гледач.","video":"https://www.youtube.com/watch?v=o6K6wcUx4EA","type":"diploma","category":"software","mentor":"","has_thumbnail":false,"links":{"github":"https://github.com/Hristiyyann/Diploma-Project","demo":""},"creators":[{"name":"Християн Радев","class":"12Б"}],"pictures":[{"url":"/assets/projects/PawSitter/images/image0.webp","is_thumbnail":false},{"url":"/assets/projects/PawSitter/images/image1.webp","is_thumbnail":false},{"url":"/assets/projects/PawSitter/images/image2.webp","is_thumbnail":false},{"url":"/assets/projects/PawSitter/images/image3.webp","is_thumbnail":false},{"url":"/assets/projects/PawSitter/images/image4.webp","is_thumbnail":false}],"next_id":316,"prev_id":314}
