{"id":357,"name":"Пухкаво Облаче","description":"💡Проектът Пухкаво Облаче е дипломна работа в 12 клас, паралелка 'Мрежи'. Насочен в сферата на облачните решения. Темата е: 'Агрегация на логове на контейнизирани приложения'.\n\n⏰ В днешно време нарастващите компаниите се нуждаят от лесно менижиране на логове.\n\n❓За да може едно уеб приложение да работи безпроблемно е необходимо да се следят и анализират логовете. Това обаче може да бъде трудно, особено когато говорим за мащабируеми приложения, които се изпълняват в контейнеризирани приложения в облачни среди. \n\n ❌Неправилната конфигурация на Логове може да доведе до: \n → Огромни файлове - липса на място\n → Неправилна преценка на важността им\n → Неправилно съхраняване \n → Грешно предоставена информация \n → Изпуснати важни събития\n → Липса на информация \n\nМоето решение позволява на инжинерите да:\n✅Контролират\n✅Анализират\n✅Съхраняват  \nпрофесионално и лесно логовете без да се нуждаят от допълнително хардуерно оборудване или да се притесняват за проблеми с изчерпване на капацитета на сървърите. \n\n👉🏻 Разработеното облачно решение е важна част от съвременните приложения, предоставяйки ценна информация и осигурявайки необходимия капацитет за съхранение и анализ на данни в облачната среда.  \n\n🧑🏻‍💻Технологии \nNginx \nКогато потребителят подаде заявка към приложението чрез интернет, тя се получава от NGINX уеб сървъра, който е конфигуриран и контролиран от NGINX Ingress Controller. Той осигурява управление на конфигурацията на NGINX сървъра и гарантира гладко и сигурно пренасочване на заявките.\n━━━━━━━━━\nDjango Application\nТестово приложение, прилагащо интрегриран logger, който експортира логове. Данните от логовете се събират от Promtail. \n━━━━━━━━━\nPromtail\nКолектор и анализатор на логове, който е естествено интегриран с Loki. Събира логовете от Django приложението.\n━━━━━━━━━\nGrafana Loki \nЛоговете, събрани от Promtail, се изпращат към Grafana Loki. След като логовете бъдат получени от Loki, те се индексират и съхраняват в компресиран формат, който позволява бързи и ефективни заявки.\n━━━━━━━━━\nGrafana\nПредлага разнообразни инструменти и функции за визуализиране на логове. Предлага създаването персонализирани табла за управление, които показват данните от логовете в реално време.\n━━━━━━━━━\nGCS\nСъхраняването на логове в Google Cloud Storage (GCS) е надеждно и мащабируемо решение за управление и анализ на големи обеми от данни от логове в облака.","video":"https://www.youtube.com/watch?v=X2tb2ujxRlQ","type":"diploma","category":"networks","mentor":"","has_thumbnail":true,"links":{"github":"https://gitlab.com/diplom-works-2022/logging-in-containerized-cloud-based-applications","demo":""},"creators":[{"name":"Мариян Видков","class":"12Г"}],"pictures":[{"url":"/assets/projects/Пухкаво Облаче/images/image0.webp","is_thumbnail":false},{"url":"/assets/projects/Пухкаво Облаче/images/image1.webp","is_thumbnail":false},{"url":"/assets/projects/Пухкаво Облаче/images/image2.webp","is_thumbnail":false},{"url":"/assets/projects/Пухкаво Облаче/images/image3.webp","is_thumbnail":false},{"url":"/assets/projects/Пухкаво Облаче/images/image4.webp","is_thumbnail":false},{"url":"/assets/projects/Пухкаво Облаче/thumbnail.webp","is_thumbnail":true}],"next_id":358,"prev_id":356}
