{"id":377,"name":"Julta Kartina S kotka","description":"Здравейте, това е проект на отбор 'Жълта картина с котка'. Той се състои от аркадна машина с две авторски игри към нея.\nИдеята на проекта е да забавлява хората, като по приятен и не натрапчив начин ги обучава за вирусите в интернет.\nКутията на аркадната машина е направена от осб плоскости, бутоните и са свързани с Raspberry Pi 4. Първата игра представлява 2D платформър, в който стреляш по вирусите, за да почистиш компютъра си от навлезлите вредители.\nВтората игра представлява 2D  top-down игра, в която играчът се стреми да унищожи възможно по-голяма част от компютъра, използвайки вирусни атаки, наподобяващи тези на компютърните вируси в реалния живот. \nЗдравейте, представям Ви проектът на отбор 'Жълта картина с котка', който включва аркадна машина с две авторски игри.\nИдеята на проекта е да забавлява хората, като им предоставя едновременно забавление и обучение за вирусите в интернет. Това става по приятен и не натрапчив начин, като им дава възможност да придобият знания и опит в борбата с компютърните вируси.\nКутията на аркадната машина е направена от осб плоскости, а бутоните са свързани с Raspberry Pi 4. Първата игра е 2D платформър, в която играчът стреля по вирусите, за да почисти компютъра си от вредители. Втората игра е 2D top-down игра, където играчът се опитва да унищожи възможно по-голямата част от компютър , използвайки вирусни атаки, подобни на тези на компютърните вируси в реалния живот.","video":"https://www.youtube.com/watch?v=gB4A4PTaFDc","type":"extra","category":"embedded","mentor":"","has_thumbnail":true,"links":{"github":"https://github.com/MartinovG/Hack_Tues_1001_Security_Breach.git","demo":""},"creators":[{"name":"Габриел Мартинов","class":"9Г"},{"name":"Билян Костадинов","class":"9Г"},{"name":"Йоана Ризова","class":"9Г"},{"name":"Борис Беличев","class":"9Г"},{"name":"Борис Стоянов","class":"9Г"}],"pictures":[{"url":"/assets/projects/Julta Kartina S kotka/images/image0.webp","is_thumbnail":false},{"url":"/assets/projects/Julta Kartina S kotka/images/image1.webp","is_thumbnail":false},{"url":"/assets/projects/Julta Kartina S kotka/thumbnail.webp","is_thumbnail":true}],"next_id":378,"prev_id":376}
