export const ABOUT_TITLE = 'За събитието';

export const ABOUT_TEXT = `ТУЕС Фест (в първите си издания наричан Ден на отворените врати на ТУЕС) е ежегодно изложение на проекти, курсови и дипломни работи в областта на софтуера, компютърните мрежи и вградените системи и роботиката, създадени от талантливите ученици на Технологично училище „Електронни системи“ (ТУЕС) към Технически университет – София.   Каним ви да разгледате интересните проекти, които учениците са подготвили. Гледайте и панелните дискусии с ученици, преподаватели и завършили туесари. 

Смятаме, че най-добрият начин да се представи училището е именно чрез успехите на учениците, които учат в него. За ТУЕС връзката с ИТ бизнеса е неизбежна и основополагаща вече повече от 30 години. Освен професионална подготовка възпитаниците му получават и близост с професионалисти от големите компании в ИТ сектора, които следят развитието на учениците и подкрепят редовно инициативите на ТУЕС, една от които е именно ТУЕС Фест.`;

export const ABOUT_BUTTON = 'научете повече за ТУЕС';

export const ABOUT_SUBTEXT =
	'Вижте програмата на ТУЕС Фест 2022 и следете събитието във Facebook за актуални новини! Разгледайте невероятните проекти на учениците.';

export const ABOUT_IMAGE = '/assets/home/about.jpeg';
