import { TbBusinessplan, TbLiveView, TbQuestionMark, TbScale, TbSchool, TbTerminal2 } from 'react-icons/tb';

export const EXPECTATIONS = [
	{
		icon: <TbTerminal2 size={34} />,
		title: 'Интригуващи проекти',
		text: `Разгледайте най-добрите технологични проекти на учениците от ТУЕС в сайта и на livestream програмата на ТУЕС Фест.`,
	},
	{
		icon: <TbScale size={34} />,
		title: 'Онлайн гласуване',
		text: `Гласувайте онлайн за проекта, впечатлил Ви най-много, за да му помогнете да спечели наградата на публиката!`,
	},
	{
		icon: <TbQuestionMark size={34} />,
		title: 'Въпроси и отговори',
		text: `Задавайте своите въпроси, свързани с училището, а ние ще отговорим! Ще можете да се включите в онлайн дискусиите и да се срещнете виртуално със създателите на проектите в ТУЕС Фест.`,
	},
	{
		icon: <TbSchool size={34} />,
		title: 'За училището',
		text: `Научете повече за специалния образователен модел на ТУЕС и какво прави училището толкова успешно.`,
	},
	{
		icon: <TbBusinessplan size={34} />,
		title: 'Връзка с бизнеса',
		text: `Научете повече за тясната връзка с ИТ бизнеса, която е ключова за ТУЕС. Чуйте мнението и на бизнес партньорите на училището.`,
	},
	{
		icon: <TbLiveView size={34} />,
		title: 'На живо',
		text: `Тази година ТУЕС Фест ще се проведе на живо във форум "Джон Атанасов" в София Тех Парк. Ще се радваме да ви видим!`,
	},
];
